// 1) მომხმარებელს შეყავს ორი რიცხვი, თქვენ უნდა დაითვალოთ პირველი რიცხვიდან მეორე რიცხვამდე ყველა ნატურალური რიცხვის ჯამი

let a = +prompt("შეიყვანეთ პირველი რიცხვი");
let b = +prompt("შეიყვანეთ მეორე რიცხვი");
let sum = 0;

if (a < b) {
  for (let i = a; i < b; i++) {
    sum += i;
    console.log(sum);
  }
} else {
  alert("პირველი რიცხვი აუცილებლად უნდა იყოს მეორე რიცხვზე მეტი");
}

// 2) მომხმარებელს შეყავს ორი რიცხვი, თქვენ უნდა დაითვალოთ პირველი რიცხვიდან მეორე რიცხვამდე ყველა ნატურალური რიცხვის ნამრავლი

let mult = 1;

if (a < b) {
  for (let i = a; i < b; i++) {
    mult *= i;
    console.log(mult);
  }
} else {
  alert("პირველი რიცხვი აუცილებლად უნდა იყოს მეორე რიცხვზე მეტი");
}

// 3) დაითვალეთ 100 დან 100000-მდე ყველა ისეთი რიცხვის რაოდენობა რომელიც იყოფა 11ზე უნაშთოდ

let count = 0;

for (let i = 100; i < 100000; i++) {
  if (i % 11 === 0) {
    count++;
  }
}

console.log(count);

// 4) მომხმარებელს შეყავს ქართული ასოები. თქვენ უნდა დაწეროთ კონსოლში ეს ასო ხმოვანია თუ თანხმოვანი.

// ლოგიკას ვერ მივხვდი და შესაბამისად ვერ დავწერე ------------------------------------------------------------

// 5) მომხმარებელს შეყავს რიცხვი. თქვენ უნდა დაბეჭდოთ კონსოლში ამ რიცხვიდან 1-მდე ყველა რიცხვი.

let number = +prompt("შეიყვანეთ რიცხვი");

for (let i = number; i > 1; i--) {
  console.log(i);
}

// 6) მომხმარებელს შეყავს რიცხვი(მინიმუმ 2 ნიშნა). კონსოლში დაბეჭდეთ ამ რიცხვის ბოლო ციფრი(მაგ: 25 -ის შემთხვევაში 5, 139 - ის შემთხვევაში 9 და ასე შემდეგ)მომხმარებელს შეყავს ორი რიცხვი, თქვენ უნდა დაითვალოთ პირველი რიცხვიდან მეორე რიცხვამდე ყველა ნატურალური რიცხვის ჯამი

let number2 = +prompt("შეიყვანეთ მინიმუმ 2 ნიშნა რიცხვი");

if (number2 > 10 || number2 < -10) {
  let result = Math.abs(number2 % 10);
  console.log(result);
} else {
  alert("რიცხვი აუცილებლად უნდა იყოს 2 ნიშნა");
}
